def get_subject_emoji(subject_name: str) -> str:
    subject = subject_name.lower()
    
    mapping = {
        "алгебра": "📐",
        "геометрия": "📐",
        "математика": "➗",
        "русский": "🇷🇺",
        "литература": "📖",
        "физика": "🔭",
        "химия": "🧪",
        "биология": "🧬",
        "история": "📜",
        "обществознание": "⚖️",
        "география": "🌍",
        "английский": "🇬🇧",
        "немецкий": "🇩🇪",
        "французский": "🇫🇷",
        "физкультура": "🏃",
        "физическая культура": "🏃",
        "обж": "⛑️",
        "информатика": "💻",
        "технология": "🔨",
        "изо": "🎨",
        "музыка": "🎵",
        "экономика": "💰",
        "право": "⚖️",
        "астрономия": "🌌",
        "родной язык": "🗣️",
        "разговоры о важном": "🇷🇺",
        "вероятность": "🎲",
        "статистика": "📊"
    }
    
    for key, emoji in mapping.items():
        if key in subject:
            return emoji
            
    return "📘"
